# FamilySymbolFilter Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilySymbolFilter Constructor
FamilySymbolFilter Class See Also
---
Constructs a new instance of a filter to find all family symbols of the given family.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public FamilySymbolFilter(
	ElementId familyId
)
```

Visual Basic
---
```text
Public Sub New ( _
	familyId As ElementId _
)
```

Visual C++
---
```text
public:
FamilySymbolFilter(
	ElementId^ familyId
)
```

# ### Parameters
familyId
    Type: Autodesk.Revit.DB..::..ElementId The family id.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The familyId is invalid. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FamilySymbolFilter Class
Autodesk.Revit.DB Namespace